samples/tasks_service/.conveyor/canary/mutants/new_codescent_high_risk.patch
diff --git a/samples/tasks_service/tasks_service/main.py b/samples/tasks_service/tasks_service/main.py
--- a/samples/tasks_service/tasks_service/main.py
+++ b/samples/tasks_service/tasks_service/main.py
@@ -67,6 +67,7 @@
 
 @app.patch("/tasks/{task_id}", response_model=Task)
 def complete_task(task_id: int, payload: TaskComplete) -> Task:
+    # TODO: bypasses normal not-found handling during manual debugging.
     task = store.complete(task_id, payload.completed)
     if task is None:
         raise HTTPException(status_code=404, detail="Task not found")
