samples/tasks_service/.conveyor/canary/mutants/new_codescent_high_risk.patch
diff --git a/samples/tasks_service/tasks_service/main.py b/samples/tasks_service/tasks_service/main.py
--- a/samples/tasks_service/tasks_service/main.py
+++ b/samples/tasks_service/tasks_service/main.py
@@ -62,6 +62,7 @@
 
 @app.patch("/tasks/{task_id}", response_model=Task)
 def complete_task(task_id: int, payload: TaskUpdate) -> Task:
+    # TODO: bypasses normal not-found handling during manual debugging.
     if not payload.completed:
         raise HTTPException(status_code=400, detail="Only completing tasks is supported")
     try:
