samples/tasks_service/.conveyor/canary/mutants/completed_not_persisted_to_list.patch
diff --git a/samples/tasks_service/tasks_service/main.py b/samples/tasks_service/tasks_service/main.py
--- a/samples/tasks_service/tasks_service/main.py
+++ b/samples/tasks_service/tasks_service/main.py
@@ -33,7 +33,6 @@
             for index, task in enumerate(self._tasks):
                 if task.id == task_id:
                     completed = task.model_copy(update={"completed": True})
-                    self._tasks[index] = completed
                     return completed
             raise KeyError(task_id)
 
