samples/tasks_service/.conveyor/canary/mutants/default_completed_missing.patch
diff --git a/samples/tasks_service/tasks_service/main.py b/samples/tasks_service/tasks_service/main.py
--- a/samples/tasks_service/tasks_service/main.py
+++ b/samples/tasks_service/tasks_service/main.py
@@ -12,7 +12,6 @@
 class Task(BaseModel):
     id: int
     title: str
-    completed: bool = False
 
 
 class TaskUpdate(BaseModel):
