samples/tasks_service/.conveyor/canary/mutants/forbidden_policy_edit.patch
diff --git a/samples/tasks_service/conveyor.plan.yml b/samples/tasks_service/conveyor.plan.yml
--- a/samples/tasks_service/conveyor.plan.yml
+++ b/samples/tasks_service/conveyor.plan.yml
@@ -79,4 +79,4 @@
     conflict_domains:
       - tasks_api
       - in_memory_task_store
-    autonomy_ceiling: L1
+    autonomy_ceiling: L4
